vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/LIB/NXP/LPC315x/lpc315x_mci_driver.c
/***********************************************************************
* $Id::$
*
* Project: LPC315x SD/MMC/SDIO controller driver
*
* Description:
*     This file contains driver support for the LPC315x SD/MMC/SDIO
*     controller.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
*********************************************************************/
#include <stdio.h>
#include <string.h>

#include "lpc_sdmmc.h"
#include "lpc315x_sysreg.h"
#include "lpc315x_ioconf_driver.h"
#include "lpc315x_cgu_driver.h"
#include "lpc315x_timer_driver.h"
#include "lpc315x_mci_driver.h"

#define USE_WIDE    /* Allow WIDE mode */
#define US_TIMEOUT 1000000 /* give 1 atleast 1 sec for the card to respond */
#define MS_ACQUIRE_DELAY	(10)/* inter-command acquire oper condition delay in msec*/
#define INIT_OP_RETRIES   10  /* initial OP_COND retries */
#define SET_OP_RETRIES    200 /* set OP_COND retries */


/* global instance of the current card*/
static MCI_CARD_INFO_T g_card_info;

/***********************************************************************
 * MCI driver private functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: prv_card_acquired
 *
 * Purpose: Checks whether card is acquired properly or not.
 *
 * Processing:
 *     Check if a valid CID data is present for the card.
 *
 * Parameters:
 *     pdev: Pointer to card info structure
 *
 * Outputs: None
 *
 * Returns: TRUE is card is enumerated else return FALSE.
 *
 * Notes: None
 *
 **********************************************************************/
static BOOL_32 prv_card_acquired(MCI_CARD_INFO_T* pdev)
{
  return (pdev->cid[0] != 0);
}

/***********************************************************************
 *
 * Function: prv_get_bits
 *
 * Purpose: Helper function to get a bit field withing multi-word
 *  buffer. Used to get fields with-in CSD & EXT-CSD structures.
 *
 * Processing:
 *     Based bit position computes the 32 word index with buffer and
 *  extracts the bit field value. The function takes care of bit fieds
 *  which cross the word boundary.
 *
 * Parameters:
 *     start: Start position of the bit field
 *     end  : Start position of the bit field
 *     data : Pointer to buffer
 *
 * Outputs: None
 *
 * Returns: The bit field value.
 *
 * Notes:
 *  The function assumes max. of 32 bi per bit field. For bit fields
 *  above 32-bit shouldn't use this function.
 *
 **********************************************************************/
static UNS_32 prv_get_bits(int start, int end, UNS_32* data)
{
  UNS_32 v;
  UNS_32 i = end >> 5;
  UNS_32 j = start & 0x1f;

  if (i == (start >> 5))
    v = (data[i] >> j);
  else
    v = ((data[i] << (32 - j)) | (data[start >> 5] >> j));

  return (v & ((1 << (end - start + 1)) - 1));
}

/***********************************************************************
 *
 * Function: prv_clear_all
 *
 * Purpose: Clears the FIFOs, response and data, and the interrupt status.
 *
 * Processing:
 *     clears the FIFOs, response and data, and the interrupt status.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: None
 *
 * Notes: None
 *
 **********************************************************************/
static void prv_clear_all(void)
{
  /* reset all blocks */
  MCI->ctrl |= MCI_CTRL_FIFO_RESET;
  /* wait till resets clear */
  while (MCI->ctrl & MCI_CTRL_FIFO_RESET);

  /* Clear interrupt status */
  MCI->rintsts = 0xFFFFFFFF;
}

/***********************************************************************
 *
 * Function: prv_send_cmd
 *
 * Purpose: Function to send command to Card interface unit (CIU).
 *
 * Processing:
 *     Send command to Card interface unit (CIU).
 *
 * Parameters:
 *     cmd  : Command with all flags set.
 *     arg  : Argument for the command
 *
 * Outputs: None
 *
 * Returns: TRUE if times-out.
 *
 * Notes: None
 *
 **********************************************************************/
static int prv_send_cmd(UNS_32 cmd, UNS_32 arg)
{
  volatile int tmo = 50;
  volatile int delay;
  /* set command arg reg*/
  MCI->cmdarg = arg;
  MCI->cmd = MCI_CMD_START | cmd;

  /* poll untill command is accepted by the CIU */
  while (--tmo && (MCI->cmd & MCI_CMD_START))
  {
    if (tmo & 1)
      delay = 50;
    else
      delay = 18000;

    while (--delay > 1);
  }

  return (tmo < 1) ? 1 : 0;
}

/***********************************************************************
 *
 * Function: prv_set_clock
 *
 * Purpose: Function to set speed of the clock going to card.
 *
 * Processing:
 *     Sets speed of the clock going to external card.
 *
 * Parameters:
 *     speed  : Clock speed.
 *
 * Outputs: None
 *
 * Returns: None.
 *
 * Notes: None
 *
 **********************************************************************/
static void prv_set_clock(UNS_32 speed)
{
  /* compute SD/MMC clock dividers */
  UNS_32 mmc_clk = cgu_get_clk_freq(CGU_SB_SD_MMC_CCLK_IN_ID);
  UNS_32 div = ((mmc_clk / speed) + 2) >> 1;

  if ((div == MCI->clkdiv) && MCI->clkena)
    return; /* requested speed is already set */

  /* disable clock */
  MCI->clkena = 0;
  MCI->clksrc = 0;

  /* inform CIU */
  prv_send_cmd(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);

  /* set clock to desired speed */
  MCI->clkdiv = div;
  /* inform CIU */
  prv_send_cmd(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);

  /* enable clock */
  MCI->clkena = MCI_CLKEN_ENABLE;
  /* inform CIU */
  prv_send_cmd(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);
}

/***********************************************************************
 *
 * Function: prv_pull_response
 *
 * Purpose: Function to retrieve command response.
 *
 * Processing:
 *     Retrieves a command response.
 *
 * Parameters:
 *     pdev: Pointer to card info structure
 *     length  : the length of the expected response, in bits.
 *
 * Outputs: None
 *
 * Returns: None.
 *
 * Notes: None
 *
 **********************************************************************/
static void prv_pull_response(MCI_CARD_INFO_T* pdev, int length)
{
  /* on this chip response is not a fifo so read all 4 regs */
  pdev->response[0] = MCI->resp0;
  pdev->response[1] = MCI->resp1;
  pdev->response[2] = MCI->resp2;
  pdev->response[3] = MCI->resp3;
}

/***********************************************************************
 *
 * Function: prv_pull_data
 *
 * Purpose: Function to read data from the FIFO.
 *
 * Processing:
 *     Reads the data from fifo.
 *
 * Parameters:
 *     pv: Pointer to buffer
 *     cnt  : the length of the expected data, in bytes.
 *
 * Outputs: None
 *
 * Returns: None.
 *
 * Notes: None
 *
 **********************************************************************/
static int prv_pull_data(MCI_CARD_INFO_T* pdev, UNS_8* pv, int cnt)
{
  int i = 0;
  int fcnt;

  while (i < cnt)
  {
    fcnt = MCI_STS_GET_FCNT(MCI->status) << 2;
    /* LPC315x maps address above 0x18000100 to FIFO to support
    burst reading. So let's use memcpy to speedup read. Since we
    always pass 4byte aligned address and also multiple of 4 count
    let's hope memcpy of C runtime does LDMs.*/
    if (fcnt)
      memcpy(pv + i, (void*)&MCI->data, fcnt);
    
    i += fcnt;

