vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/LIB/NXP/LPC315x/lpc315x_mci_driver.c
  }
  return i;
}

/***********************************************************************
 *
 * Function: prv_push_data
 *
 * Purpose: Function to write data to the FIFO.
 *
 * Processing:
 *     Writes the data to fifo.
 *
 * Parameters:
 *     pv: Pointer to buffer
 *     cnt  : the length of the expected data, in bytes.
 *
 * Outputs: None
 *
 * Returns: None.
 *
 * Notes: None
 *
 **********************************************************************/
static void prv_push_data(const UNS_8* pv, UNS_32 cb)
{
  int i = 0;
  int fcnt;

  while (i < cb)
  {
    fcnt = MCI_FIFO_SZ - (MCI_STS_GET_FCNT(MCI->status) << 2);
    /* LPC315x maps address above 0x18000100 to FIFO to support
    burst writing. So let's use memcpy to speedup write. Since we
    always pass 4byte aligned address and also multiple of 4 count
    let's hope memcpy of C runtime does STMs (store multiples).*/
    memcpy((void*)&MCI->data, pv + i, fcnt);
    i += fcnt;
  }
}

/***********************************************************************
 *
 * Function: prv_wait_for_completion
 *
 * Purpose: Polls for command completion.
 *
 * Processing:
 *     Appends additional error flags to the status bits requested by
 *  the caller. And invokes the busy poll routine or wait_func set by
 *  the application.
 *
 * Parameters:
 *     pdev : Pointer to card info structure
 *     bit  : Status bits to poll for command completion.
 *
 * Outputs: None
 *
 * Returns: Status of the command.
 *
 * Notes: None
 *
 **********************************************************************/
static UNS_32 prv_wait_for_completion(MCI_CARD_INFO_T* pdev, UNS_32 bits)
{
  UNS_32 status = 0;
  int tmo_count = US_TIMEOUT;

  /* also check error conditions */
  bits |= MCI_INT_EBE | MCI_INT_SBE | MCI_INT_HLE
          | MCI_INT_RTO | MCI_INT_RCRC | MCI_INT_RESP_ERR;

  if (bits & MCI_INT_DATA_OVER)
    bits |= MCI_INT_FRUN | MCI_INT_HTO | MCI_INT_DTO
            | MCI_INT_DCRC;

  if (pdev->wait_func == NULL)
  {
    /* do busy polling when wait_func is not set*/
    do
    {
      timer_wait_us(NULL, 1);
      status = MCI->rintsts;

      if (--tmo_count < 1)
      {
        break;
      }
    }
    while ((status  & bits) == 0);
    /* set time out flag for driver timeout also */
    status |= ((tmo_count < 1) ? MCI_INT_RTO : 0);
  }
  else
  {
    /* call wait function set by application */
    status = pdev->wait_func(pdev, bits);
  }

  return status;
}

/***********************************************************************
 *
 * Function: prv_process_csd
 *
 * Purpose: Function to process the CSD & EXT-CSD of the card.
 *
 * Processing:
 *     Computes the card paramaters such as size, read block length,
 * 	 no. of blocks etc. based on cards CSD & EXT-CSD response.
 *
 * Parameters:
 *     pdev: Pointer to card info structure
 *
 * Outputs: None
 *
 * Returns: None.
 *
 * Notes: None
 *
 **********************************************************************/
static void prv_process_csd(MCI_CARD_INFO_T* pdev)
{
  INT_32 status = 0;
  INT_32 c_size = 0;
  INT_32 c_size_mult = 0;
  INT_32 mult = 0;

  /* compute block length based on CSD response */
  pdev->block_len = 1 << prv_get_bits(80, 83, pdev->csd);

  if ((pdev->card_type & CARD_TYPE_HC) &&
      (pdev->card_type & CARD_TYPE_SD))
  {
    /* See section 5.3.3 CSD Register (CSD Version 2.0) of SD2.0 spec
    an explanation for the calculation of these values
    */
    c_size = prv_get_bits(48, 63, (UNS_32*)pdev->csd) + 1;
    pdev->blocknr = c_size << 10; /* 512 byte blocks */
  }
  else
  {
    /* See section 5.3 of the 4.1 revision of the MMC specs for
    an explanation for the calculation of these values
    */
    c_size = prv_get_bits(62, 73, (UNS_32*)pdev->csd);
    c_size_mult = prv_get_bits(47, 49, (UNS_32*)pdev->csd); //csd_c_size_mult ();
    mult = 1 << (c_size_mult + 2);
    pdev->blocknr = (c_size + 1) * mult;
    /* adjust blocknr to 512/block */
    if (pdev->block_len > MMC_SECTOR_SIZE)
      pdev->blocknr = pdev->blocknr * (pdev->block_len >> 9);

    /* get extended CSD for newer MMC cards CSD spec >= 4.0*/
    if (((pdev->card_type & CARD_TYPE_SD) == 0) &&
        (prv_get_bits(122, 125, (UNS_32*)pdev->csd) >= 4))
    {
      /* put card in trans state */
      status = mci_execute_command(pdev, CMD_SELECT_CARD, pdev->rca << 16, 0);
      /* set block size and byte count */
      MCI->blksiz = MMC_SECTOR_SIZE;
      MCI->bytcnt = MMC_SECTOR_SIZE;
      /* send EXT_CSD command */
      status = mci_execute_command(pdev, CMD_SEND_EXT_CSD, 0, MCI_INT_CMD_DONE
                                   | MCI_INT_DATA_OVER | MCI_INT_RXDR);

      if ((status & MCI_INT_ERROR) == 0)
      {
        /* read 512bytes EXT-CSD data */
        prv_pull_data(pdev, (UNS_8*)pdev->ext_csd, MMC_SECTOR_SIZE);

        /* check EXT_CSD_VER is greater than 1.1 */
        if ((pdev->ext_csd[48] & 0xFF) > 1)
          pdev->blocknr = pdev->ext_csd[53]; /* bytes 212:215 represent sec count */

        /* switch to 52MHz clock if card type is set to 1 or else set to 26MHz */
        if ((pdev->ext_csd[49] & 0xFF) == 1)
        {
          /* for type 1 MMC cards high speed is 52MHz */
          pdev->speed = MMC_HIGH_BUS_MAX_CLOCK;
        }
        else
        {
          /* for type 0 MMC cards high speed is 26MHz */
          pdev->speed = MMC_LOW_BUS_MAX_CLOCK;
        }
      }
    }
  }

  pdev->device_size = pdev->blocknr << 9; /* blocknr * 512 */
}

/***********************************************************************
 *
 * Function: prv_set_trans_state
 *
 * Purpose: Puts current selected card in trans state
 *
 * Processing:
 *     Puts current selected card in trans state
 *
 * Parameters:
 *     pdev: Pointer to card info structure
 *
 * Outputs: None
 *
 * Returns: Error if unable to put card in trans state.
 *
 * Notes: None
 *
 **********************************************************************/
static int prv_set_trans_state(MCI_CARD_INFO_T* pdev)
{
  UNS_32 status;

  /* get current state of the card */
  status = mci_execute_command(pdev, CMD_SEND_STATUS, pdev->rca << 16, 0);
  if (status & MCI_INT_RTO)
  {
    /* unable to get the card state. So return immediatly. */
    return _ERROR;
  }
  /* check card state in response */
  status = R1_CURRENT_STATE(pdev->response[0]);
  switch (status)
  {
  case SDMMC_STBY_ST:
    /* put card in 'Trans' state */
    status = mci_execute_command(pdev, CMD_SELECT_CARD, pdev->rca << 16, 0);
    if (status != 0)
    {
      /* unable to put the card in Trans state. So return immediatly. */
      return _ERROR;
    }
    break;
  case SDMMC_TRAN_ST:
    /*do nothing */
    break;
  default:
    /* card shouldn't be in other states so return */
    return _ERROR;
  }

#if defined (USE_WIDE)
  if (pdev->card_type & CARD_TYPE_SD)
  {
    mci_execute_command(pdev, CMD_SD_SET_WIDTH, 2, 0);  /* SD, 4 bit width */
    /* if positive response */
    MCI->ctype = MCI_CTYPE_4BIT;
  }
#endif

